Revit 2027 API
FabricationServiceSettings.GetFluidType Method
 Gets the fluid type of the specified service.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ElementId GetFluidType(
	FabricationService service
)
Public Function GetFluidType (
	service As FabricationService
) As ElementId
public:
ElementId^ GetFluidType(
	FabricationService^ service
)
member GetFluidType :
        service : FabricationService -> ElementId
Parameters
service FabricationService
 The service to lookup.
Return Value
ElementId
 The fluid type id.
Exceptions
Exception | Condition
ArgumentException |  service is not mapped to a fluid type and temperature.
ArgumentNullException |  A non-optional argument was null
See Also
Reference
FabricationServiceSettings Class
Autodesk.Revit.DB Namespace